In [175]:
import requests
import pandas as pd 
import numpy as np 

gdpDf= pd.read_csv('./Data/world-gdp.csv',
                        header=2)

inflationRateDf = pd.read_csv('./Data/singapore-inflation-rate.csv',
                              header=9, 
                              skipfooter=29,
                              na_values="na")

# https://www.macrotrends.net/countries/SGP/singapore/unemployment-rate#:~:text=Unemployment%20refers%20to%20the%20share,a%200.56%25%20decline%20from%202020.
unemploymentRateDf = pd.read_csv('./Data/singapore-unemployment-rate.csv',
                                 header=9)

gradEmploymentSurveyDf = pd.read_csv('./Data/GraduateEmploymentSurveyNTUNUSSITSMUSUSSSUTD.csv', na_values='na')

C:\Users\yongj\AppData\Local\Temp\ipykernel_19292\2976636476.py:8: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  inflationRateDf = pd.read_csv('./Data/singapore-inflation-rate.csv',

<hr>

## Text Based Analysis

In [176]:
# Creating function to get information from data
def get_info(df, name):
    print(60*"*" ,f"\nInformation on {name}", '\n' + "*"*60 + '\n') 
    print(f'There are {df.shape[0]} rows and {df.shape[1]} columns in this dataset\n')
    print(f'The names of the columns are')
    for col in df.columns:
        print(f'- {col} ({df[col].dtypes}), na values: {df[col].isna().sum()}, unique values: {len(list(df[col].unique()))}')

In [177]:
get_info(gdpDf, "GDP")

************************************************************
Information on GDP
************************************************************

There are 266 rows and 68 columns in this dataset

The names of the columns are
- Country Name (object), na values: 0, unique values: 266
- Country Code (object), na values: 0, unique values: 266
- Indicator Name (object), na values: 0, unique values: 1
- Indicator Code (object), na values: 0, unique values: 1
- 1960 (float64), na values: 140, unique values: 125
- 1961 (float64), na values: 139, unique values: 127
- 1962 (float64), na values: 138, unique values: 127
- 1963 (float64), na values: 138, unique values: 127
- 1964 (float64), na values: 138, unique values: 128
- 1965 (float64), na values: 126, unique values: 139
- 1966 (float64), na values: 123, unique values: 143
- 1967 (float64), na values: 120, unique values: 145
- 1968 (float64), na values: 115, unique values: 150
- 1969 (float64), na values: 115, unique values: 150
- 1970 (float64), na values: 106, unique values: 160
- 1971 (float64), na values: 103, unique values: 163
- 1972 (float64), na values: 103, unique values: 163
- 1973 (float64), na values: 103, unique values: 162
- 1974 (float64), na values: 102, unique values: 164
- 1975 (float64), na values: 100, unique values: 165
- 1976 (float64), na values: 99, unique values: 166
- 1977 (float64), na values: 96, unique values: 169
- 1978 (float64), na values: 97, unique values: 168
- 1979 (float64), na values: 96, unique values: 169
- 1980 (float64), na values: 83, unique values: 182
- 1981 (float64), na values: 79, unique values: 187
- 1982 (float64), na values: 77, unique values: 188
- 1983 (float64), na values: 75, unique values: 190
- 1984 (float64), na values: 73, unique values: 192
- 1985 (float64), na values: 71, unique values: 194
- 1986 (float64), na values: 69, unique values: 196
- 1987 (float64), na values: 65, unique values: 200
- 1988 (float64), na values: 59, unique values: 206
- 1989 (float64), na values: 55, unique values: 210
- 1990 (float64), na values: 40, unique values: 226
- 1991 (float64), na values: 41, unique values: 224
- 1992 (float64), na values: 38, unique values: 228
- 1993 (float64), na values: 36, unique values: 230
- 1994 (float64), na values: 34, unique values: 231
- 1995 (float64), na values: 25, unique values: 240
- 1996 (float64), na values: 25, unique values: 240
- 1997 (float64), na values: 25, unique values: 240
- 1998 (float64), na values: 24, unique values: 242
- 1999 (float64), na values: 23, unique values: 242
- 2000 (float64), na values: 19, unique values: 247
- 2001 (float64), na values: 17, unique values: 248
- 2002 (float64), na values: 12, unique values: 253
- 2003 (float64), na values: 12, unique values: 254
- 2004 (float64), na values: 12, unique values: 255
- 2005 (float64), na values: 12, unique values: 254
- 2006 (float64), na values: 11, unique values: 254
- 2007 (float64), na values: 11, unique values: 254
- 2008 (float64), na values: 10, unique values: 255
- 2009 (float64), na values: 10, unique values: 255
- 2010 (float64), na values: 9, unique values: 256
- 2011 (float64), na values: 6, unique values: 259
- 2012 (float64), na values: 8, unique values: 257
- 2013 (float64), na values: 7, unique values: 258
- 2014 (float64), na values: 6, unique values: 259
- 2015 (float64), na values: 8, unique values: 257
- 2016 (float64), na values: 8, unique values: 257
- 2017 (float64), na values: 8, unique values: 257
- 2018 (float64), na values: 8, unique values: 257
- 2019 (float64), na values: 8, unique values: 257
- 2020 (float64), na values: 9, unique values: 256
- 2021 (float64), na values: 10, unique values: 255
- 2022 (float64), na values: 23, unique values: 242
- Unnamed: 67 (float64), na values: 266, unique values: 1

In [178]:
get_info(inflationRateDf, "Inflation Rate")

************************************************************
Information on Inflation Rate
************************************************************

There are 8 rows and 35 columns in this dataset

The names of the columns are
- Data Series (object), na values: 0, unique values: 5
- 2023  (float64), na values: 0, unique values: 8
- 2022  (float64), na values: 0, unique values: 8
- 2021  (float64), na values: 0, unique values: 8
- 2020  (float64), na values: 0, unique values: 8
- 2019  (float64), na values: 0, unique values: 5
- 2018  (float64), na values: 0, unique values: 8
- 2017  (float64), na values: 0, unique values: 7
- 2016  (float64), na values: 0, unique values: 8
- 2015  (float64), na values: 0, unique values: 8
- 2014  (float64), na values: 3, unique values: 6
- 2013  (float64), na values: 6, unique values: 3
- 2012  (float64), na values: 6, unique values: 3
- 2011  (float64), na values: 6, unique values: 3
- 2010  (float64), na values: 6, unique values: 3
- 2009  (float64), na values: 6, unique values: 3
- 2008  (float64), na values: 6, unique values: 3
- 2007  (float64), na values: 6, unique values: 3
- 2006  (float64), na values: 6, unique values: 3
- 2005  (float64), na values: 6, unique values: 3
- 2004  (float64), na values: 6, unique values: 3
- 2003  (float64), na values: 6, unique values: 3
- 2002  (float64), na values: 6, unique values: 3
- 2001  (float64), na values: 6, unique values: 3
- 2000  (float64), na values: 6, unique values: 3
- 1999  (float64), na values: 6, unique values: 3
- 1998  (float64), na values: 6, unique values: 3
- 1997  (float64), na values: 6, unique values: 3
- 1996  (float64), na values: 6, unique values: 3
- 1995  (float64), na values: 6, unique values: 3
- 1994  (float64), na values: 6, unique values: 3
- 1993  (float64), na values: 6, unique values: 3
- 1992  (float64), na values: 6, unique values: 3
- 1991  (float64), na values: 6, unique values: 3
- 1990  (float64), na values: 7, unique values: 2

In [179]:
get_info(unemploymentRateDf, "Unemployment Rate")

************************************************************
Information on Unemployment Rate
************************************************************

There are 32 rows and 4 columns in this dataset

The names of the columns are
- date (object), na values: 0, unique values: 32
-  Unemployment Rate (%) (float64), na values: 0, unique values: 32
-  Annual Change (float64), na values: 1, unique values: 28
-   (float64), na values: 32, unique values: 1

In [180]:
get_info(gradEmploymentSurveyDf, "Graduate Employment Survey")

************************************************************
Information on Graduate Employment Survey
************************************************************

There are 1121 rows and 12 columns in this dataset

The names of the columns are
- year (int64), na values: 0, unique values: 9
- university (object), na values: 0, unique values: 6
- school (object), na values: 28, unique values: 68
- degree (object), na values: 0, unique values: 337
- employment_rate_overall (float64), na values: 89, unique values: 226
- employment_rate_ft_perm (float64), na values: 89, unique values: 393
- basic_monthly_mean (float64), na values: 89, unique values: 798
- basic_monthly_median (float64), na values: 89, unique values: 182
- gross_monthly_mean (float64), na values: 89, unique values: 796
- gross_monthly_median (float64), na values: 89, unique values: 237
- gross_mthly_25_percentile (float64), na values: 89, unique values: 175
- gross_mthly_75_percentile (float64), na values: 89, unique values: 284

### Dataset 1 - GDP

In [181]:
gdpDf

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,Unnamed: 67
0,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,2.790850e+09,2.962907e+09,2.983635e+09,3.092429e+09,3.276184e+09,3.395799e+09,2.558906e+09,3.103184e+09,3.544708e+09,NaN
1,Africa Eastern and Southern,AFE,GDP (current US$),NY.GDP.MKTP.CD,1.847810e+10,1.936631e+10,2.050647e+10,2.224273e+10,2.429433e+10,2.661956e+10,...,1.006992e+12,9.325135e+11,8.900514e+11,1.028394e+12,1.012521e+12,1.006191e+12,9.288802e+11,1.086531e+12,1.185138e+12,NaN
2,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,5.377778e+08,5.488889e+08,5.466667e+08,7.511112e+08,8.000000e+08,1.006667e+09,...,2.049713e+10,1.913422e+10,1.811657e+10,1.875346e+10,1.805322e+10,1.879944e+10,1.995593e+10,1.426650e+10,NaN,NaN
3,Africa Western and Central,AFW,GDP (current US$),NY.GDP.MKTP.CD,1.041165e+10,1.113592e+10,1.195171e+10,1.268581e+10,1.384900e+10,1.487476e+10,...,8.945050e+11,7.692632e+11,6.921149e+11,6.856303e+11,7.681582e+11,8.234056e+11,7.869624e+11,8.449275e+11,8.753937e+11,NaN
4,Angola,AGO,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.359668e+11,9.049642e+10,5.276162e+10,7.369016e+10,7.945069e+10,7.089796e+10,4.850156e+10,6.650513e+10,1.067828e+11,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,Kosovo,XKX,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,7.074395e+09,6.295848e+09,6.682677e+09,7.180765e+09,7.878760e+09,7.899738e+09,7.717145e+09,9.412034e+09,9.409474e+09,NaN
262,"Yemen, Rep.",YEM,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,4.322859e+10,4.244449e+10,3.131782e+10,2.684223e+10,2.160616e+10,NaN,NaN,NaN,NaN,NaN
263,South Africa,ZAF,GDP (current US$),NY.GDP.MKTP.CD,8.748597e+09,9.225996e+09,9.813996e+09,1.085420e+10,1.195600e+10,1.306899e+10,...,3.811989e+11,3.467098e+11,3.235855e+11,3.814488e+11,4.052607e+11,3.893300e+11,3.382914e+11,4.201178e+11,4.052709e+11,NaN
264,Zambia,ZMB,GDP (current US$),NY.GDP.MKTP.CD,7.130000e+08,6.962857e+08,6.931429e+08,7.187143e+08,8.394286e+08,1.082857e+09,...,2.714102e+10,2.125122e+10,2.095841e+10,2.587360e+10,2.631151e+10,2.330867e+10,1.811064e+10,2.209642e+10,2.916378e+10,NaN
265,Zimbabwe,ZWE,GDP (current US$),NY.GDP.MKTP.CD,1.052990e+09,1.096647e+09,1.117602e+09,1.159512e+09,1.217138e+09,1.311436e+09,...,1.949552e+10,1.996312e+10,2.054868e+10,1.758489e+10,3.415607e+10,2.183223e+10,2.150970e+10,2.837124e+10,2.736663e+10,NaN

### Dataset 2 - Inflation Rate

In [194]:
inflationRateDf

,Data Series,2023,2022,2021,2020,2019,2018,2017,2016,2015,...,1999,1998,1997,1996,1995,1994,1993,1992,1991,1990
0,MAS Core Inflation Measure (Index),109.274,104.918,100.769,99.845,100.0,98.966,97.327,95.933,95.076,...,72.736,72.376,72.091,70.997,69.744,68.246,66.562,65.398,64.359,62.094
1,Percent Change Over Corresponding Period Of ...,4.200,4.100,0.900,-0.200,1.0,1.700,1.500,0.900,0.500,...,0.500,0.400,1.500,1.800,2.200,2.500,1.800,1.600,3.600,NaN
2,Services Inflation Measure (Index),107.701,103.899,100.710,99.460,100.0,98.448,97.033,95.577,94.435,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Percent Change Over Corresponding Period Of ...,3.700,3.200,1.300,-0.500,1.6,1.500,1.500,1.200,0.900,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Retail & Other Goods Inflation Measure (Index),101.656,99.354,97.387,98.501,100.0,100.140,98.769,98.577,98.304,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Percent Change Over Corresponding Period Of ...,2.300,2.000,-1.100,-1.500,-0.1,1.400,0.200,0.300,0.100,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Electricity & Gas Inflation Measure (Index),115.202,111.263,93.026,91.638,100.0,105.006,95.831,87.893,99.649,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,Percent Change Over Corresponding Period Of ...,3.500,19.600,1.500,-8.400,-4.8,9.600,9.000,-11.800,-14.500,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Dataset - 3 Unemployment Rate

In [192]:
unemploymentRateDf.head()

         date   Unemployment Rate (%)   Annual Change
0  1991-12-31                    2.18             NaN NaN
1  1992-12-31                    3.09            0.91 NaN
2  1993-12-31                    3.07           -0.02 NaN
3  1994-12-31                    3.03           -0.04 NaN
4  1995-12-31                    3.30            0.27 NaN

### Dataset - 4 Graduate Employment Survey

In [195]:
gradEmploymentSurveyDf

,year,university,school,degree,employment_rate_overall,employment_rate_ft_perm,basic_monthly_mean,basic_monthly_median,gross_monthly_mean,gross_monthly_median,gross_mthly_25_percentile,gross_mthly_75_percentile
0,2013,Nanyang Technological University,College of Business (Nanyang Business School),Accountancy and Business,97.4,96.1,3701.0,3200.0,3727.0,3350.0,2900.0,4000.0
1,2013,Nanyang Technological University,College of Business (Nanyang Business School),Accountancy (3-yr direct Honours Programme),97.1,95.7,2850.0,2700.0,2938.0,2700.0,2700.0,2900.0
2,2013,Nanyang Technological University,College of Business (Nanyang Business School),Business (3-yr direct Honours Programme),90.9,85.7,3053.0,3000.0,3214.0,3000.0,2700.0,3500.0
3,2013,Nanyang Technological University,College of Business (Nanyang Business School),Business and Computing,87.5,87.5,3557.0,3400.0,3615.0,3400.0,3000.0,4100.0
4,2013,Nanyang Technological University,College of Engineering,Aerospace Engineering,95.3,95.3,3494.0,3500.0,3536.0,3500.0,3100.0,3816.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1116,2021,Singapore University of Social Sciences,School of Business,Bachelor of Science in Supply Chain Management,97.4,79.5,3245.0,3200.0,3381.0,3300.0,3025.0,3500.0
1117,2021,Singapore University of Technology and Design,NaN,Bachelor of Engineering (Computer Science and ...,98.3,96.7,4936.0,4800.0,5030.0,4800.0,4400.0,5414.0
1118,2021,Singapore University of Technology and Design,NaN,Bachelor of Engineering (Engineering Product D...,89.9,85.5,4047.0,4000.0,4141.0,4000.0,3750.0,4500.0
1119,2021,Singapore University of Technology and Design,NaN,Bachelor of Engineering (Engineering Systems a...,95.5,90.9,4542.0,4500.0,4778.0,4700.0,3900.0,5000.0
1120,2021,Singapore University of Technology and Design,NaN,Bachelor of Science (Architecture and Sustaina...,96.6,89.7,3800.0,3801.0,3842.0,3875.0,3430.0,4200.0

<hr>
Since the intersect of all the year from each dataset is 2013-2021, we will have to subset the dataframes to only contain the range of year from 2013-2021

Dataset 1: Since we are doing research on Singapore, we only have to look at Singapore and World GDP per capita to see how World's GDP per capita affects employment salary ad well as Singapore's own GDP per capita, we also need to convert the years from columns to rows and subset the years from 2013 - 2022

### Preparing GDP Dataset

Since we want to know how GDP affects salary in Singapore, we will only be looking at the Worlds and Singapore's GDP

In [215]:
# Select only Singapore and World GDP Per Capita
gdp_filtered = gdpDf[gdpDf['Country Name'].isin(['Singapore', 'World'])]

# Since columns names contain str values we will have to subset the data using iloc
index_of_2015 = gdp_filtered.columns.get_loc('2015')
index_of_2021 = gdp_filtered.columns.get_loc('2021')

# Select year from 2013 to 2022, this will also remove unwanted columns such as country code, country name and 
gdp_filtered = gdp_filtered.iloc[:, index_of_2015:index_of_2021 + 1]

# Verify Changes made
gdp_filtered

,2015,2016,2017,2018,2019,2020,2021
208,3.079985e+11,3.190301e+11,3.432729e+11,3.768695e+11,3.768376e+11,3.483921e+11,4.237971e+11
259,7.528327e+13,7.651898e+13,8.148410e+13,8.654268e+13,8.777740e+13,8.525774e+13,9.752968e+13

Now we will need to convert the years from columns into rows by getting the transpose of the dataset

In [216]:
# Conver year to column by getting the transpose and reseting index
gdp_filtered = gdp_filtered.T.reset_index()

# Rename the columns containing GDP values
gdp_filtered = gdp_filtered.rename(columns={208: 'Singapore ($USD Billion)', 259: 'World ($USD Billion)', "index": 'year'})

# # Convert the unit into billion for easier visualization
gdp_filtered[['Singapore ($USD Billion)', 'World ($USD Billion)']] = gdp_filtered[['Singapore ($USD Billion)', 'World ($USD Billion)']].div(1e9)

# Convert year to int value
gdp_filtered['year']=gdp_filtered['year'].astype(int)

# Verify Changes made
get_info(gdp_filtered, "Filtered GDP")
gdp_filtered

************************************************************
Information on Filtered GDP
************************************************************

There are 7 rows and 3 columns in this dataset

The names of the columns are
- year (int32), na values: 0, unique values: 7
- Singapore ($USD Billion) (float64), na values: 0, unique values: 7
- World ($USD Billion) (float64), na values: 0, unique values: 7

   year  Singapore ($USD Billion)  World ($USD Billion)
0  2015                307.998545          75283.270552
1  2016                319.030058          76518.978974
2  2017                343.272879          81484.101071
3  2018                376.869492          86542.678179
4  2019                376.837580          87777.403956
5  2020                348.392091          85257.737350
6  2021                423.797101          97529.676807

### Dataset 2

In [219]:
inflationRateDf_filtered = inflationRateDf.set_index(['Data Series']).T
inflationRateDf_filtered = inflationRateDf_filtered.iloc[2:11, [0,2,4,6]].sort_index(ascending=True).reset_index()
inflationRateDf_filtered

# Change the year from index to new column
inflationRateDf_filtered.sort_index(ascending=True).reset_index(inplace=True)

# Rename column from index to year
inflationRateDf_filtered = inflationRateDf_filtered.rename(columns={'index': 'year'})

# Convert year to int value
inflationRateDf_filtered['year'] = inflationRateDf_filtered['year'].astype(int)

# # Verify changes made
get_info(inflationRateDf_filtered, "filtered inflation rate")
inflationRateDf_filtered

************************************************************
Information on filtered inflation rate
************************************************************

There are 9 rows and 5 columns in this dataset

The names of the columns are
- year (int32), na values: 0, unique values: 9
- MAS Core Inflation Measure (Index) (float64), na values: 0, unique values: 9
- Services Inflation Measure (Index) (float64), na values: 1, unique values: 9
- Retail & Other Goods Inflation Measure (Index) (float64), na values: 1, unique values: 9
- Electricity & Gas Inflation Measure (Index) (float64), na values: 1, unique values: 9

Data Series,year,MAS Core Inflation Measure (Index),Services Inflation Measure (Index),Retail & Other Goods Inflation Measure (Index),Electricity & Gas Inflation Measure (Index)
0,2013,92.799,NaN,NaN,NaN
1,2014,94.607,93.602,98.245,116.547
2,2015,95.076,94.435,98.304,99.649
3,2016,95.933,95.577,98.577,87.893
4,2017,97.327,97.033,98.769,95.831
5,2018,98.966,98.448,100.140,105.006
6,2019,100.000,100.000,100.000,100.000
7,2020,99.845,99.460,98.501,91.638
8,2021,100.769,100.710,97.387,93.026

Since there are missing values in 2013 for Services Inflation Measure, Retail & Other Goods Inflation Measure and Electricity & Gas inflation Measure for the year 2013, we will be using a simple linear regression model to fill in the missing values

### Dataset 3

In [223]:
# Get rid of last column which is unamed when loading csv
unemploymentRateDfP_filtered = unemploymentRateDf.iloc[-10:-1, :-1].reset_index()

# Create new column year which converts date from YYYY-MM-DD
unemploymentRateDfP_filtered['year'] = unemploymentRateDfP_filtered['date'].str[:4]
unemploymentRateDfP_filtered=unemploymentRateDfP_filtered[['year', 	' Unemployment Rate (%)']]

# Convert year to int value
unemploymentRateDfP_filtered['year'] = unemploymentRateDfP_filtered['year'].astype(int)

# Verify changes made
get_info(unemploymentRateDfP_filtered, "filtered unemployment rate")
unemploymentRateDfP_filtered

************************************************************
Information on filtered unemployment rate
************************************************************

There are 9 rows and 2 columns in this dataset

The names of the columns are
- year (int32), na values: 0, unique values: 9
-  Unemployment Rate (%) (float64), na values: 0, unique values: 9

   year   Unemployment Rate (%)
0  2013                   3.860
1  2014                   3.740
2  2015                   3.790
3  2016                   4.080
4  2017                   4.200
5  2018                   3.641
6  2019                   3.100
7  2020                   4.100
8  2021                   3.540

### Dataset 4

In [189]:
# gradEmploymentSurveyDf['degree'][gradEmploymentSurveyDf.duplicated('degree')]

gradEmploymentSurveyDf_nona = gradEmploymentSurveyDf.dropna()

gradEmploymentSurveyDf_nona = gradEmploymentSurveyDf_nona.groupby(['university', 'school', 'year'])[['gross_monthly_median']].mean()

In [225]:
# Filter the DataFrame to include only data from 2015 to 2021
filtered_df = gradEmploymentSurveyDf_nona[(gradEmploymentSurveyDf_nona.index.get_level_values('year') >= 2015) 
                                          & (gradEmploymentSurveyDf_nona.index.get_level_values('year') <= 2021)]

# Group by school and count the number of entries for each school
school_counts = filtered_df.groupby(level=['university', 'school']).size()

# # # Get the schools with entries for all years from 2015 to 2021
schools_with_all_years = school_counts[school_counts == 7].index

# gradEmploymentSurveyDf_nona[gradEmploymentSurveyDf_nona.index.get_level_values(['university','school']).isin(schools_with_all_years)].reset_index()

filtered_df_reset = filtered_df.reset_index()

# Filter the DataFrame based on schools_with_all_years
filtered_data = filtered_df_reset[filtered_df_reset[['university', 'school']].
                                  apply(tuple, axis=1).
                                  isin(schools_with_all_years)]

filtered_data.reset_index(inplace=True, drop=True)

get_info(filtered_data, "filtered graduate survery")
# filtered_data['university'].unique()
# filtered_data['school'].unique()

************************************************************
Information on filtered graduate survery
************************************************************

There are 91 rows and 4 columns in this dataset

The names of the columns are
- university (object), na values: 0, unique values: 3
- school (object), na values: 0, unique values: 13
- year (int64), na values: 0, unique values: 7
- gross_monthly_median (float64), na values: 0, unique values: 83

In [239]:
datasets = [filtered_data, gdp_filtered, unemploymentRateDfP_filtered, inflationRateDf_filtered]

final_df = datasets[0]

for df in datasets[1:]:
    final_df = pd.merge(final_df, df, on='year', how='inner')

final_df = final_df.sort_values(by='school').reset_index(drop=True)
final_df

,university,school,year,gross_monthly_median,Singapore ($USD Billion),World ($USD Billion),Unemployment Rate (%),MAS Core Inflation Measure (Index),Services Inflation Measure (Index),Retail & Other Goods Inflation Measure (Index),Electricity & Gas Inflation Measure (Index)
0,Nanyang Technological University,College of Business (Nanyang Business School),2015,3607.00,307.998545,75283.270552,3.790,95.076,94.435,98.304,99.649
1,Nanyang Technological University,College of Business (Nanyang Business School),2016,3575.00,319.030058,76518.978974,4.080,95.933,95.577,98.577,87.893
2,Nanyang Technological University,College of Business (Nanyang Business School),2021,4550.00,423.797101,97529.676807,3.540,100.769,100.710,97.387,93.026
3,Nanyang Technological University,College of Business (Nanyang Business School),2018,3768.75,376.869492,86542.678179,3.641,98.966,98.448,100.140,105.006
4,Nanyang Technological University,College of Business (Nanyang Business School),2019,3858.25,376.837580,87777.403956,3.100,100.000,100.000,100.000,100.000
...,...,...,...,...,...,...,...,...,...,...,...
86,Singapore Institute of Technology,The Glasgow School of Art,2017,2700.00,343.272879,81484.101071,4.200,97.327,97.033,98.769,95.831
87,Singapore Institute of Technology,The Glasgow School of Art,2018,2862.50,376.869492,86542.678179,3.641,98.966,98.448,100.140,105.006
88,Singapore Institute of Technology,The Glasgow School of Art,2016,2557.50,319.030058,76518.978974,4.080,95.933,95.577,98.577,87.893
89,Singapore Institute of Technology,The Glasgow School of Art,2019,2750.00,376.837580,87777.403956,3.100,100.000,100.000,100.000,100.000
90,Singapore Institute of Technology,The Glasgow School of Art,2021,3000.00,423.797101,97529.676807,3.540,100.769,100.710,97.387,93.026